# Copyright (c) 2023, NVIDIA CORPORATION & AFFILIATES. All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions
# are met:
#  * Redistributions of source code must retain the above copyright
#    notice, this list of conditions and the following disclaimer.
#  * Redistributions in binary form must reproduce the above copyright
#    notice, this list of conditions and the following disclaimer in the
#    documentation and/or other materials provided with the distribution.
#  * Neither the name of NVIDIA CORPORATION nor the names of its
#    contributors may be used to endorse or promote products derived
#    from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY
# EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
# IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR
# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY
# OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
# OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

name: "yolov5m_ensemble"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "input_image"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]
output [
  {
    name: "result_image"
    data_type: TYPE_FP32
    dims: [-1, -1, 3 ]
  },
  {
    name: "postprocess_output"
    data_type: TYPE_FP32
    dims: [-1, 6 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "preprocess_input"
        value: "input_image"
      }
      output_map {
        key: "preprocessed_image"
        value: "preprocessed_image"
      },
      output_map {
        key: "resized_image"
        value: "resized_image"
      },
      output_map {
        key: "resized_config"
        value: "resized_config"
      }
    },
    {
      model_name: "yolov5m_onnx"
      model_version: -1
      input_map {
        key: "images"
        value: "preprocessed_image"
      }
      output_map {
        key: "output0"
        value: "output0"
      }
    },
    {
      model_name: "postprocess"
      model_version: -1
      input_map {
        key: "yolo_output"
        value: "output0"
      }
      input_map {
        key: "ORIGINAL_IMAGE"
        value: "input_image"
      }
      input_map {
        key: "RESIZED_IMAGE"
        value: "resized_image"
      }
      input_map {
        key: "RESIZED_CONFIG"
        value: "resized_config"
      }
      output_map {
        key: "postprocess_output"
        value: "postprocess_output"
      }
      output_map {
        key: "result_image"
        value: "result_image"
      }
    }
  ]
}

