name: "preprocess"
backend: "python"
max_batch_size: 0
input [
{
    name: "preprocess_input"
    data_type: TYPE_UINT8
    dims: [ -1 ]
}
]
output [
{
  name: "preprocessed_image" 
  data_type: TYPE_FP32
  dims: [1, 3, 448, 448 ]
},
{
    name: "resized_image"
    data_type: TYPE_FP32
    dims: [448, 448, 3 ]
},
{
    name: "resized_config"
    data_type: TYPE_FP32
    dims: [1, 3 ]
}
]

instance_group [{ kind: KIND_CPU }]